#include "help.h"
About::About(QWidget *parent) : QWidget(parent)
{
    for (int i = 0; i < 9; i++)
    {
        v.addWidget(&l[i]);
    }
    w.setLayout(&v);
    w.setWindowTitle("About");

    QPixmap p(":/img/f(x)=sin(abs(x)-10).png");
    l[0].setPixmap(p);
    l[1].setText("Grafic 0.7(b15) - alpha");
    //l[2]
    l[3].setText("Автор програми:          \t\t\t\t|\t\t\t Керівник:               ");
    l[4].setText("Учень 11-го класу        \t\t\t\t|\t\t\t Вчитель інформатики     ");
    l[5].setText("ЗОШ І-ІІІ ст. с. Пісочне \t\t\t\t|\t\t\t ЗОШ І-ІІІ ст. с. Пісочне");
    l[6].setText("Крисак Іван Миколайович  \t\t\t\t|\t\t\t Матвіюк Дмитро Юрійович ");
    //l[7]
    l[8].setText("Програма написана в QtCreator 3.2.1, що заснований на Qt 5.3.2");
}

void About::open()
{
    w.show();
}

Help::Help(QWidget *parent) : QWidget(parent)
{
    b1.setText("Інтерфейс");
    b2.setText("Можливості");
    b0.setText("Вступ");

    l.setText(""
              "Вітаю в файлі допомоги.\n"
              "Дякую, що користуєтеся моєю програмою.\n"
              "\n"
              "Для додаткових відомостей про автора, натисніть кнопку \"About\" в нижньому лівому кутку головного вікна програми.\n"
              "\n"
              "Основною ціллю програми є швидка схематична побудова графіка. В подальших версіях буде доданий перерахунок окремих значень.\n"
              "\n"
              "З основними елементами інтерфейу і їх призначенням ви можете ознайомитись, натиснувши кнопку \"Інтерфейс\".\n"
              "Усі можливості програми представлені в сторінці, яка відкривається натисканням кнопки \"Можливості\".\n"
              );

    b0.setCheckable(true);
    b0.setChecked(true);
    b1.setCheckable(true);
    b2.setCheckable(true);

    h.addWidget(&b0);
    h.addWidget(&b1);
    h.addWidget(&b2);
    v.addLayout(&h,0);
    v.addWidget(&l,0);
    v.addStretch(100);


    w.setLayout(&v);
    w.setWindowTitle("Допомога");
    QFont *font = new QFont("Arial", 12);
    w.setFont(*font);

    connect(&b1,SIGNAL(clicked()),SLOT(inter()));
    connect(&b2,SIGNAL(clicked()),SLOT(m()));
    connect(&b0,SIGNAL(clicked()),SLOT(start()));
}


void Help::open()
{
    w.showMaximized();
}

void Help::inter()
{
    b0.setChecked(false);
    b2.setChecked(false);
    b1.setChecked(true);

    l.setText(""
              "Інтерфейс побудований дуже просто і ділиться на дві важливи застини:\n"
              " - верхня(де відбувається настройка функції).\n"
              " - нижня(де графік відоражається і відбуваються настройки його огляду.\n"
              "\n"
              "\tВерхня частина:\n"
              "Чотири поля, перше для текстого задання самої функції(f(x) = [   ]).\n"
              "Друге і третє для задання проміжку, я кому буде будуватися графік.\n"
              "А четверте для задання кроку обчислень. Чим менший крок, тим точніше буде побудований графік, але будуватись від буде довше.\n"
              "Важливо слідкувати, щоб це значення не було від'ємним і не дорівнювало нулю.\n"
              "\n"
              "\tНижня частина:\n"
              "Ця частина займає майже увесь простір вікна. Основний простій зайнятий власне місцем для графіка функції\n"
              "Зліва і справа знаходяться елементи управлінням відмітками. Кожен із цих елементів складається із трьох частин: прапорця, повзунка і числової відмітки.\n"
              "Прапорцем визначається будуть показані відмітки, чи ні.\n"
              "Повзунок доданий для досить точної і якісної настройки інтервалу між кожними двома сусідніми відмітками.\n"
              "А числова відмітка під повзунком показує це саме точне значення інтервалу.\n"
              "Під основним полем, де з'являється графік знаходиться повзунок, який дозвляє змінювати масштаб і дві кнопки:\n"
              " - кнопка справки \"Help\", яка і викликає ось це меню в з допомогою.\n"
              " - кнопка про автора \"About\".\n"
              );
}

void Help::m()
{
    b1.setChecked(false);
    b0.setChecked(false);
    b2.setChecked(true);

    l.setText("Функції, які підтримуються програмою на даний момент:\n"
              "• операція додавання f(x) = x+5;\n"
              "• операція віднімання f(x) = x-5;\n"
              "• операція мнoження f(x) = x*5;\n"
              "• операція ділення f(x) = x/5;\n"
              "• операція піднесення до степеня f(x) = x^5;\n"
              "• операції управління порядком виконання(дужки) f(x) = 2*(x+5);\n"
              "• операція визначення модуля числа f(x) = abs(x).\n"
              "• знахоження квадратного кореня f(x) = sr(x), де sr ⎯ скорочення від square root(квадратний корінь),\n"
              "\tв дужках вказується вираз з якого потрібно добути корінь;\n"
              "• основні тригонометричні функції, зокрема:\n"
                      "\tf(x) = sin(x),\n"
                      "\tf(x) = cos(x),\n"
                      "\tf(x) = tg(x),\n"
                      "\tf(x) = ctg(x),\n"
                      "\tf(x) = arcsin(x),\n"
                      "\tf(x) = arccos(x),\n"
                      "\tf(x) = arctg(x),\n"
                      "\tf(x) = arcctg(x);\n"
              "• логарифмічні функції:\n"
                      "\tf(x) = log_2(x), де основа вказується перед дужками,\n"
                      "\tf(x) = lg(x), тобто десятковий логарифм(за основою 10),\n"
                      "\tf(x) = ln(x), тобто натуральний логарифм(за основою \"е\");\n"
              "• константи, зокрема:\n"
                      "\tpi ≈ 3.14159265358979323846;\n"
                      "\te ≈ 2.7182818284590452354.\n"

              );
}

void Help::start()
{
    b1.setChecked(false);
    b2.setChecked(false);
    b0.setChecked(true);

    l.setText(""
              "Вітаю в файлі допомоги.\n"
              "Дякую, що користуєтеся моєю програмою.\n"
              "\n"
              "Для додаткових відомостей про автора, натисніть кнопку \"About\" в нижньому лівому кутку головного вікна програми.\n"
              "\n"
              "Основною ціллю програми є швидка схематична побудова графіка. В подальших версіях буде доданий перерахунок окремих значень.\n"
              "\n"
              "З основними елементами інтерфейу і їх призначенням ви можете ознайомитись, натиснувши кнопку \"Інтерфейс\".\n"
              "Усі можливості програми представлені в сторінці, яка відкривається натисканням кнопки \"Можливості\".\n"
              );
}
